Дошкольное_учреждение83/src/DataProcessors/удуФормированиеСпискаРаботников/удуФормированиеСпискаРаботников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>удуФормированиеСпискаРаботников</name>
  <attributes>
    <name>КомпоновщикНастроек</name>
    <type>
      <types>DataCompositionSettingsComposer</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаАктуальности</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУволенных</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьУволенных</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыбиратьСотрудника</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьДоговорников</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОпределятьДатыПриемаУвольнения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.удуУчреждения</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

Дошкольное_учреждение83/src/DataProcessors/удуФормированиеСпискаРаботников/ManagerModule.bsl
Процедура ЗаполнитьНачальныеНастройки(Объект, НачальноеЗаполнение = Истина) Экспорт
	
	СхемаКомпоновкиДанных=Обработки.удуФормированиеСпискаРаботников.ПолучитьМакет("Макет");
	
	удуУправлениеОтчетами.ИнициализироватьКомпоновщикНастроек(Объект.КомпоновщикНастроек, ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных));
	 		
КонецПроцедуры

Функция ПолучитьСписокРаботников(Объект) Экспорт
	
	СхемаКомпоновкиДанных=Обработки.удуФормированиеСпискаРаботников.ПолучитьМакет("Макет");
	КомпоновщикМакетаКомпоновкиДанных=Новый КомпоновщикМакетаКомпоновкиДанных;
	КомпоновщикНастроек=Новый КомпоновщикНастроекКомпоновкиДанных;
	
	удуУправлениеОтчетами.ИнициализироватьКомпоновщикНастроек(КомпоновщикНастроек, ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных));
	
	КомпоновщикНастроек.ЗагрузитьНастройки(Объект.КомпоновщикНастроек.ПолучитьНастройки());
	удуУправлениеОтчетами.УстановитьПараметр(КомпоновщикНастроек, "ГоловнаяОрганизация", Объект.Организация, Истина);
	удуУправлениеОтчетами.УстановитьПараметр(КомпоновщикНастроек, "ДатаАктуальности", Объект.ДатаАктуальности, Истина);
	удуУправлениеОтчетами.УстановитьПараметр(КомпоновщикНастроек, "ВключатьУволенных", Объект.ВключатьУволенных, Истина);
	удуУправлениеОтчетами.УстановитьПараметр(КомпоновщикНастроек, "ДатаУвольнения", Объект.ДатаУволенных, Истина);
	
	
	МакетКомпоновкиДанных=КомпоновщикМакетаКомпоновкиДанных.Выполнить(СхемаКомпоновкиДанных,КомпоновщикНастроек.Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	ПроцессорКомпоновкиДанных=Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных);
	ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений=Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ТЗ=Новый ТаблицаЗначений;
	ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений.УстановитьОбъект(ТЗ);
	ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений.Вывести(ПроцессорКомпоновкиДанных);
	
	Возврат ТЗ;
			 		
КонецФункции
